# pandas - data manipulation

In [1]:
import pandas as pd

In [3]:
df2 = pd.DataFrame({'Names': ['Simon', 'Kate', 'Francis', 'Laura', 'Mary', 'Julian', 'Rosie', 'Simon', 'Laura'],
                   'Height':[180, 165, 170, 164, 163, 175, 166, 180, 164],
                   'Weight':[85, 65, 68, 45, 43, 72, 46, 85, 45],
                   'Pref_food': ['steak', 'pizza', 'pasta', 'pizza', 'vegetables', 'steak', 'seafood', 'steak', 'pizza'],
                   'Sex': ['m','f','m','f','f','m','f', 'm', 'f']})

In [4]:
print(df2)

   Height    Names   Pref_food Sex  Weight
0     180    Simon       steak   m      85
1     165     Kate       pizza   f      65
2     170  Francis       pasta   m      68
3     164    Laura       pizza   f      45
4     163     Mary  vegetables   f      43
5     175   Julian       steak   m      72
6     166    Rosie     seafood   f      46
7     180    Simon       steak   m      85
8     164    Laura       pizza   f      45

In [5]:
df_dummy = pd.get_dummies(df2['Sex'], prefix = 'Sex')

In [6]:
df_dummy

   Sex_f  Sex_m
0      0      1
1      1      0
2      0      1
3      1      0
4      1      0
5      0      1
6      1      0
7      0      1
8      1      0

In [8]:
df2.join(df_dummy)

   Height    Names   Pref_food Sex  Weight  Sex_f  Sex_m
0     180    Simon       steak   m      85      0      1
1     165     Kate       pizza   f      65      1      0
2     170  Francis       pasta   m      68      0      1
3     164    Laura       pizza   f      45      1      0
4     163     Mary  vegetables   f      43      1      0
5     175   Julian       steak   m      72      0      1
6     166    Rosie     seafood   f      46      1      0
7     180    Simon       steak   m      85      0      1
8     164    Laura       pizza   f      45      1      0

In [9]:
df2.head(2)

   Height  Names Pref_food Sex  Weight
0     180  Simon     steak   m      85
1     165   Kate     pizza   f      65

In [10]:
df3 = df2.join(df_dummy)

In [11]:
print(df3.head(2))

   Height  Names Pref_food Sex  Weight  Sex_f  Sex_m
0     180  Simon     steak   m      85      0      1
1     165   Kate     pizza   f      65      1      0

In [12]:
del df3['Sex']

In [14]:
print(df3.head(2))

   Height  Names Pref_food  Weight  Sex_f  Sex_m
0     180  Simon     steak      85      0      1
1     165   Kate     pizza      65      1      0

In [17]:
print(df2)

   Height    Names   Pref_food Sex  Weight
0     180    Simon       steak   m      85
1     165     Kate       pizza   f      65
2     170  Francis       pasta   m      68
3     164    Laura       pizza   f      45
4     163     Mary  vegetables   f      43
5     175   Julian       steak   m      72
6     166    Rosie     seafood   f      46
7     180    Simon       steak   m      85
8     164    Laura       pizza   f      45

In [ ]:
# duplicates

In [18]:
df2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

In [19]:
df2.drop_duplicates()

   Height    Names   Pref_food Sex  Weight
0     180    Simon       steak   m      85
1     165     Kate       pizza   f      65
2     170  Francis       pasta   m      68
3     164    Laura       pizza   f      45
4     163     Mary  vegetables   f      43
5     175   Julian       steak   m      72
6     166    Rosie     seafood   f      46

In [20]:
df3 = df2.drop_duplicates()

In [21]:
df3

   Height    Names   Pref_food Sex  Weight
0     180    Simon       steak   m      85
1     165     Kate       pizza   f      65
2     170  Francis       pasta   m      68
3     164    Laura       pizza   f      45
4     163     Mary  vegetables   f      43
5     175   Julian       steak   m      72
6     166    Rosie     seafood   f      46

In [14]:
# drop to remove cases

In [23]:
print(df2.drop(2))

   Height   Names   Pref_food Sex  Weight
0     180   Simon       steak   m      85
1     165    Kate       pizza   f      65
3     164   Laura       pizza   f      45
4     163    Mary  vegetables   f      43
5     175  Julian       steak   m      72
6     166   Rosie     seafood   f      46
7     180   Simon       steak   m      85
8     164   Laura       pizza   f      45

In [ ]:
# rearrange the data

In [24]:
df3.stack()

0  Height              180
   Names             Simon
   Pref_food         steak
   Sex                   m
   Weight               85
1  Height              165
   Names              Kate
   Pref_food         pizza
   Sex                   f
   Weight               65
2  Height              170
   Names           Francis
   Pref_food         pasta
   Sex                   m
   Weight               68
3  Height              164
   Names             Laura
   Pref_food         pizza
   Sex                   f
   Weight               45
4  Height              163
   Names              Mary
   Pref_food    vegetables
   Sex                   f
   Weight               43
5  Height              175
   Names            Julian
   Pref_food         steak
   Sex                   m
   Weight               72
6  Height              166
   Names             Rosie
   Pref_food       seafood
   Sex                   f
   Weight               46
dtype: object

In [25]:
stacked = df3.stack()

In [26]:
unstacked = stacked.unstack()

In [27]:
print(unstacked)

  Height    Names   Pref_food Sex Weight
0    180    Simon       steak   m     85
1    165     Kate       pizza   f     65
2    170  Francis       pasta   m     68
3    164    Laura       pizza   f     45
4    163     Mary  vegetables   f     43
5    175   Julian       steak   m     72
6    166    Rosie     seafood   f     46

In [28]:
print(pd.melt(df3))

     variable       value
0      Height         180
1      Height         165
2      Height         170
3      Height         164
4      Height         163
5      Height         175
6      Height         166
7       Names       Simon
8       Names        Kate
9       Names     Francis
10      Names       Laura
11      Names        Mary
12      Names      Julian
13      Names       Rosie
14  Pref_food       steak
15  Pref_food       pizza
16  Pref_food       pasta
17  Pref_food       pizza
18  Pref_food  vegetables
19  Pref_food       steak
20  Pref_food     seafood
21        Sex           m
22        Sex           f
23        Sex           m
24        Sex           f
25        Sex           f
26        Sex           m
27        Sex           f
28     Weight          85
29     Weight          65
30     Weight          68
31     Weight          45
32     Weight          43
33     Weight          72
34     Weight          46

In [ ]:
# let's take again the original dataset df2

In [29]:
df2.head(2)

   Height  Names Pref_food Sex  Weight
0     180  Simon     steak   m      85
1     165   Kate     pizza   f      65

In [22]:
# let's transpose rows and columns

In [30]:
df2.T

,0,1,2,3,4,5,6,7,8
Height,180,165,170,164,163,175,166,180,164
Names,Simon,Kate,Francis,Laura,Mary,Julian,Rosie,Simon,Laura
Pref_food,steak,pizza,pasta,pizza,vegetables,steak,seafood,steak,pizza
Sex,m,f,m,f,f,m,f,m,f
Weight,85,65,68,45,43,72,46,85,45

In [ ]:
# we can also extract a random sample of our data using the .sample() function

In [32]:
print(df2.sample(n=2))

   Height    Names   Pref_food Sex  Weight
4     163     Mary  vegetables   f      43
2     170  Francis       pasta   m      68

In [33]:
print(df2.sample(n=2))

   Height   Names Pref_food Sex  Weight
5     175  Julian     steak   m      72
6     166   Rosie   seafood   f      46

In [ ]:
# set a seed

In [34]:
import numpy as np

In [35]:
np.random.seed(1)

In [36]:
print(df2.sample(n=2))

   Height    Names Pref_food Sex  Weight
8     164    Laura     pizza   f      45
2     170  Francis     pasta   m      68

In [37]:
np.random.seed(1)

In [38]:
df2.sample(n=2)

   Height    Names Pref_food Sex  Weight
8     164    Laura     pizza   f      45
2     170  Francis     pasta   m      68

In [ ]:
# instead of extracting a number of cases, we can extract a percentage, with the argument frac= instead of n=

In [46]:
df2.sample(frac = .1)

   Height Names Pref_food Sex  Weight
1     165  Kate     pizza   f      65

In [47]:
# we can view cases with the highest values for a certain variable by specifying the number of cases
# in this case 3, and the column, in this case "Weight"
# let us consider the df3 dataset that does not feature duplicates

In [48]:
print(df3.nlargest(3, "Height"))

   Height    Names Pref_food Sex  Weight
0     180    Simon     steak   m      85
5     175   Julian     steak   m      72
2     170  Francis     pasta   m      68

In [49]:
# let us now see the cases with the lowest values for a certain variable, also specifying the number of cases

In [50]:
print(df3.nsmallest(4, "Weight"))

   Height  Names   Pref_food Sex  Weight
4     163   Mary  vegetables   f      43
3     164  Laura       pizza   f      45
6     166  Rosie     seafood   f      46
1     165   Kate       pizza   f      65

In [51]:
# finally, we create a small dataset and reorganize data with the pivot_table() function

In [52]:
df4 = pd.DataFrame({'Date': ['2017-01-01', '2017-01-01', '2017-01-02', '2017-01-01', '2017-01-02', '2017-01-02', '2017-01-03', '2017-01-02', '2017-01-03', '2017-01-03'],
                   'Type':['x', 'x', 'y', 'x', 'y', 'x', 'z', 'y', 'z', 'y'],
                   'Value':[185, 265, 168, 245, 143, 172, 346, 285, 145, 128],
                   })

In [53]:
print(df4)

         Date Type  Value
0  2017-01-01    x    185
1  2017-01-01    x    265
2  2017-01-02    y    168
3  2017-01-01    x    245
4  2017-01-02    y    143
5  2017-01-02    x    172
6  2017-01-03    z    346
7  2017-01-02    y    285
8  2017-01-03    z    145
9  2017-01-03    y    128

In [54]:
print(pd.pivot_table(df4, index = "Date", values = "Value", columns = "Type"))

Type                 x           y      z
Date
2017-01-01  231.666667         NaN    NaN
2017-01-02  172.000000  198.666667    NaN
2017-01-03         NaN  128.000000  245.5